const aufiil = "بَتَرَ، بَذَخَ، بَذَرَ، بَرَجَ، بَرَدَ، بَرَزَ، بَرَضَ، بَرَقَ، بَرَكَ، بَزَرَ، بَزَغَ، بَزَقَ، بَصَقَ، بَطَرَ، بَطَشَ، بَطَلَ، بَغَضَ، بَلَغَ، تَجَرَ، تَرَكَ، ثَبَتَ، ثَقَبَ، ثَقَفَ، ثَمَرَ، جَبَرَ، جَبَلَ، جَثَمَ، جَدَلَ، جَذَبَ، جَرَدَ، جَرَفَ، جَسَرَ، جَفَلَ، جَلَبَ، جَمَدَ، جَهَدَ، حَبَكَ، حَجَبَ، حَجَرَ، حَجَزَ، حَدَثَ، حَرَثَ، حَرَسَ، حَرَقَ، حَرَكَ، حَسَدَ، حَسَرَ، حَشَدَ، حَشَرَ، حَصَدَ، حَصَرَ، حَصَلَ، حَضَرَ، حَضَنَ، حَظَرَ، حَقَنَ، حَكَمَ، حَلَبَ، حَلَمَ، حَمَدَ، حَمَضَ، خَبَلَ، خَدَمَ، خَذَلَ، خَرَجَ، خَرَقَ، خَزَنَ، خَطَبَ، خَفَتَ، خَفَرَ، خَلَبَ، خَلَدَ، خَلَفَ، خَلَقَ، خَمَدَ، خَمَرَ، خَنَقَ، دَبَغَ، دَبَكَ، دَخَلَ، دَرَجَ، دَرَزَ، دَرَسَ، دَفَشَ، دَفَقَ، دَلَقَ، دَلَكَ، دَمَجَ، دَمَلَ، ذَكَرَ، رَبَطَ، رَبَعَ، رَجَحَ، رَجَزَ، رَجَفَ، رَجَلَ، رَجَمَ، رَدَمَ، رَذَلَ، رَزَقَ، رَزَنَ، رَسَبَ، رَسَخَ، رَسَلَ، رَسَمَ، رَشَدَ، رَشَفَ، رَشَقَ، رَصَدَ، رَصَفَ، رَطَبَ، رَعَدَ، رَفَسَ، رَفَضَ، رَفَلَ، رَقَدَ، رَقَصَ، رَكَدَ، رَكَضَ، رَكَلَ، رَمَزَ، رَمَلَ، زَبَدَ، زَجَرَ، زَجَلَ، زَرَبَ، زَرَدَ، زَرَفَ، زَرَقَ، زَعَمَ، زَكَمَ، زَمَرَ، زَنَخَ، زَنَرَ، سَبَتَ، سَبَرَ، سَبَعَ، سَبَقَ، سَتَرَ، سَجَدَ، سَجَنَ، سَخَنَ، سَدَلَ، سَرَجَ، سَرَدَ، سَطَرَ، سَعَلَ، سَفَرَ، سَفَلَ، سَقَطَ، سَقَفَ، سَكَبَ، سَكَتَ، سَكَنَ، سَلَبَ، سَلَخَ، سَلَقَ، سَلَكَ، سَمَرَ، سَنَدَ، شَتَمَ، شَجَبَ، شَحَنَ، شَرَبَ، شَرَدَ، شَرَطَ، شَرَقَ، شَطَبَ، شَطَرَ، شَعَرَ، شَكَرَ، شَكَلَ، شَمَلَ، شَنَقَ، صَبَرَ، صَبَغَ، صَدَفَ، صَدَقَ، صَرَخَ، صَرَفَ، صَغَرَ، صَلَبَ، صَلَحَ، صَمَتَ، صَمَدَ، ضَبَطَ، ضَمَدَ، ضَمَرَ، طَبَخَ، طَرَدَ، طَرَقَ، طَعَنَ، طَلَبَ، طَلَعَ، طَلَقَ، ظَهَرَ، عَبَدَ، عَبَرَ، عَتَبَ، عَتَقَ، عَثَرَ، عَجَزَ، عَجَمَ، عَجَنَ، عَذَرَ، عَذَلَ، عَرَشَ، عَرَضَ، عَرَكَ، عَزَفَ، عَصَفَ، عَطَبَ، عَطَسَ، عَظَمَ، عَقَلَ، عَقَمَ، عَكَزَ، عَكَفَ، عَلَكَ، عَمَرَ، غَبَرَ، غَدَرَ، غَرَفَ، غَفَلَ، غَمَدَ، غَمَرَ، فَتَرَ، فَتَكَ، فَجَرَ، فَرَشَ، فَرَطَ، فَرَغَ، فَرَكَ، فَرَمَ، فَسَدَ، فَصَلَ، فَطَرَ، فَطَنَ، فَعَلَ، فَقَرَ، فَقَعَ، قَبَرَ، قَتَلَ، قَحَمَ، قَدَرَ، قَرَصَ، قَرَعَ، قَرَنَ، قَزَمَ، قَشَرَ، قَطَرَ، قَطَفَ، قَطَمَ، قَطَنَ، قَعَدَ، قَفَزَ، قَفَلَ، قَلَبَ، قَنَطَ، كَبَدَ، كَبَرَ، كَتَبَ، كَتَمَ، كَثَرَ، كَحَلَ، كَدَمَ، كَرَبَ، كَسَدَ، كَفَرَ، كَلَمَ، كَمَشَ، كَمَنَ، لَبَدَ، لَبَطَ، لَبَنَ، لَجَمَ، لَحَمَ، لَسَنَ، لَغَزَ، لَقَطَ، لَكَمَ، مَثَلَ، مَجَنَ، مَخَرَ، مَرَقَ، مَزَجَ، مَسَكَ، مَشَطَ، مَشَقَ، مَضَغَ، مَطَرَ، مَطَلَ، مَعَنَ، مَقَتَ، مَكَثَ، مَكَرَ، مَهَرَ، مَهَنَ، نَبَتَ، نَبَشَ، نَبَعَ، نَبَغَ، نَبَلَ، نَثَرَ، نَجَرَ، نَجَمَ، نَحَبَ، نَحَلَ، نَخَلَ، نَدَبَ، نَسَبَ، نَسَرَ، نَسَفَ، نَسَكَ، نَشَدَ، نَشَرَ، نَشَطَ، نَشَفَ، نَشَلَ، نَصَبَ، نَصَرَ، نَضَبَ، نَظَرَ، نَعَمَ، نَغَمَ، نَفَخَ، نَفَدَ، نَفَذَ، نَفَرَ، نَفَشَ، نَفَضَ، نَفَقَ، نَقَبَ، نَقَدَ، نَقَرَ، نَقَشَ، نَقَصَ، نَقَضَ، نَقَطَ، نَقَلَ، نَكَبَ، نَكَتَ، نَكَثَ، نَكَسَ، نَكَلَ، نَهَبَ، نَهَجَ، نَهَدَ، هَبَطَ، هَجَدَ، هَجَرَ، هَجَمَ، هَدَرَ، هَدَفَ، هَرَبَ، هَزَلَ، هَمَدَ، مَلَكَ"

const aifiil = "بَسَمَ، بَصَمَ، بَلَجَ، تَسَعَ، جَزَمَ، جَفَلَ، جَلَبَ، جَلَدَ، جَلَسَ، حَبَسَ، حَبَكَ، حَذَفَ، حَذَقَ، حَرَدَ، حَرَصَ، حَرَمَ، حَزَرَ، حَزَمَ، حَسَدَ، حَسَرَ، حَسَمَ، حَشَدَ، حَصَدَ، حَصَرَ، حَفَرَ، حَفَزَ، حَقَدَ، حَلَبَ، حَلَفَ، حَلَقَ، حَمَلَ، خَبَزَ، خَبَصَ، خَبَطَ، خَتَمَ، خَتَنَ، خَدَشَ، خَرَقَ، خَرَمَ، خَزَقَ، خَشَفَ، خَصَمَ، خَضَبَ، خَطَرَ، خَطَفَ، خَفَرَ، خَفَضَ، خَفَقَ، خَلَبَ، خَلَسَ، خَلَطَ، خَلَفَ، خَمَرَ، دَفَقَ، دَفَنَ، دَهَنَ، ذَرَفَ، رَبَضَ، رَبَطَ، رَبَعَ، رَجَحَ، رَجَعَ، رَدَمَ، رَضَخَ، رَضَعَ، رَفَدَ، رَفَضَ، رَمَزَ، زَبَلَ، زَرَقَ، زَفَرَ، زَلَقَ، زَمَرَ، سَبَتَ، سَبَقَ، سَبَكَ، سَتَرَ، سَحَلَ، سَدَلَ، سَرَقَ، سَفَدَ، سَفَرَ، سَفَكَ، سَمَرَ، سَمَطَ، شَبَكَ، شَتَمَ، شَخَرَ، شَرَطَ، شَفَقَ، شَمَلَ، شَنَقَ، صَبَرَ، صَبَغَ، صَدَفَ، صَدَمَ، صَرَفَ، صَرَمَ، صَفَدَ، صَفَرَ، صَلَبَ، صَمَدَ، صَهَلَ، ضَرَبَ، طَمَرَ، ظَفَرَ، ظَلَمَ، عَبَثَ، عَبَسَ، عَتَبَ، عَثَرَ، عَجَزَ، عَجَنَ، عَدَلَ، عَذَرَ، عَذَلَ، عَرَ، عَرَجَ، عَرَضَ، عَرَفَ، عَزَفَ، عَزَلَ، عَزَمَ، عَسَفَ، عَصَبَ، عَصَرَ، عَصَفَ، عَفَنَ، عَقَدَ، عَقَرَ، عَقَصَ، عَقَلَ، عَكَسَ، عَكَفَ، عَلَفَ، عَلَمَ، عَمَدَ، عَمَرَ، غَبَطَ، غَبَنَ، غَدَرَ، غَرَزَ، غَرَسَ، غَرَفَ، غَسَلَ، غَطَسَ، غَفَرَ، غَلَبَ، غَلَقَ، غَمَزَ، غَمَسَ، غَمَطَ، فَتَرَ، فَتَكَ، فَتَلَ، فَتَنَ، فَرَجَ، فَرَزَ، فَرَشَ، فَرَضَ، فَصَلَ، فَصَمَ، فَطَسَ، فَطَمَ، فَقَدَ، فَقَرَ، فَكَرَ، فَلَتَ، فَلَقَ، قَبَضَ، قَدَرَ، قَذَفَ، قَرَضَ، قَرَنَ، قَسَرَ، قَسَمَ، قَشَرَ، قَصَدَ، قَصَمَ، قَضَمَ، قَطَبَ، قَطَفَ، قَفَصَ، قَفَلَ، قَلَبَ، قَلَفَ، قَلَقَ، قَمَطَ، قَنَصَ، كَبَتَ، كَبَدَ، كَبَسَ، كَتَفَ، كَدَشَ، كَدَمَ، كَذَبَ، كَرَزَ، كَسَبَ، كَسَرَ، كَسَفَ، كَشَفَ، كَفَرَ، كَفَنَ، كَلَمَ، كَنَسَ، لَبَسَ، لَبَطَ، لَبَنَ، لَثَمَ، لَطَمَ، لَفَتَ، لَفَظَ، لَمَسَ، مَثَلَ، مَرَقَ، مَسَكَ، مَلَكَ، مَنَحَ، نَبَحَ، نَبَذَ، نَبَضَ، نَتَجَ، نَتَفَ، نَثَرَ، نَحَبَ، نَحَتَ، نَحَلَ، نَخَرَ، نَدَفَ، نَزَحَ، نَزَعَ، نَزَفَ، نَزَلَ، نَسَبَ، نَسَجَ، نَسَفَ، نَشَدَ، نَشَرَ، نَشَفَ، نَصَبَ، نَصَتَ، نَطَحَ، نَطَقَ، نَظَمَ، نَغَمَ، نَفَرَ، نَفَشَ، نَقَضَ، نَقَمَ، نَهَجَ، هَتَفَ، هَتَكَ، هَدَرَ، هَدَمَ، هَرَفَ، هَزَلَ، هَزَمَ، هَشَمَ، هَصَرَ، هَضَمَ، هَطَلَ، هَلَكَ، هَمَسَ"

const aafiil = "بَحَثَ، بَحَرَ، بَدَعَ، بَرَعَ، بَطَحَ، بَعَثَ، بَعَجَ، بَلَحَ، بَلَعَ، بَهَرَ، جَبَهَ، جَحَدَ، جَحَظَ، جَدَعَ، جَرَحَ، جَرَعَ، جَزَعَ، جَعَلَ، جَلَحَ، جَلَخَ، جَمَحَ، جَمَعَ، جَنَحَ، جَهَرَ، خَدَعَ، خَشَعَ، خَضَعَ، خَلَعَ، خَنَعَ، دَحَرَ، دَحَضَ، دَعَمَ، دَغَمَ، دَفَعَ، دَمَعَ، دَمَغَ، دَهَمَ، دَهَنَ، ذَبَحَ، ذَعَرَ، ذَهَبَ، رَبَعَ، رَجَحَ، رَحَلَ، رَدَعَ، رَزَحَ، رَشَحَ، رَضَخَ، رَضَعَ، رَعَبَ، رَعَدَ، رَعَفَ، رَغَمَ، رَفَعَ، رَقَعَ، رَكَعَ، رَمَ، رَهَفَ، رَهَنَ، زَحَفَ، زَحَلَ، زَحَمَ، زَخَرَ، زَرَعَ، زَعَجَ، زَعَمَ، زَغَلَ، زَلَعَ، زَهَدَ، زَهَرَ، زَهَقَ، سَبَحَ، سَبَعَ، سَجَعَ، سَحَبَ، سَحَرَ، سَحَلَ، سَخَرَ، سَرَحَ، سَطَحَ، سَطَعَ، سَعَفَ، سَفَحَ، سَقَفَ، سَكَعَ، سَلَحَ، سَلَخَ، سَمَحَ، سَنَحَ، سَهَمَ، شَحَذَ، شَحَمَ، شَحَنَ، شَخَصَ، شَرَحَ، شَرَعَ، شَطَحَ، شَعَبَ، شَغَلَ، شَفَعَ، شَلَحَ، شَمَخَ، شَمَعَ، شَهَرَ، شَهَقَ، صَبَحَ، صَبَغَ، صَدَعَ، صَرَعَ، صَفَحَ، صَفَعَ، صَلَحَ، صَنَعَ، صَهَرَ، ضَبَعَ، ضَغَطَ، ضَمَدَ، طَبَعَ، طَحَنَ، طَرَحَ، طَعَمَ، طَفَحَ، طَمَحَ، ظَهَرَ، فَتَحَ، فَجَعَ، فَحَصَ، فَخَتَ، فَخَذَ، فَخَرَ، فَرَغَ، فَسَحَ، فَسَخَ، فَضَحَ، فَعَلَ، فَغَرَ، فَغَمَ، فَقَعَ، فَلَحَ، قَبَعَ، قَحَطَ، قَدَحَ، قَرَعَ، قَطَعَ، قَلَعَ، قَمَعَ، قَهَرَ، كَبَحَ، كَدَحَ، كَرَعَ، كَسَحَ، كَلَحَ، كَهَلَ، لَحَدَ، لَحَسَ، لَحَظَ، لَحَنَ، لَدَغَ، لَذَعَ، لَسَعَ، لَطَخَ، لَعَنَ، لَغَمَ، لَفَحَ، لَقَحَ، لَمَحَ، لَمَعَ، لَهَثَ، مَتَعَ، مَحَصَ، مَحَضَ، مَحَقَ، مَحَكَ، مَحَلَ، مَحَنَ، مَخَرَ، مَدَحَ، مَرَغَ، مَزَجَ، مَسَحَ، مَسَخَ، مَضَغَ، مَعَكَ، مَعَنَ، مَغَطَ، مَنَحَ، مَنَعَ، مَهَرَ، مَهَنَ، نَبَحَ، نَجَحَ، نَحَبَ، نَحَرَ، نَحَسَ، نَزَحَ، نَسَخَ، نَصَحَ، نَطَحَ، نَعَبَ، نَعَتَ، نَعَسَ، نَعَشَ، نَعَقَ، نَعَمَ، نَغَصَ، نَفَحَ، نَفَعَ، نَكَحَ، نَهَبَ، نَهَجَ، نَهَدَ، نَهَشَ، نَهَضَ، نَهَقَ، نَهَكَ، نَهَلَ، هَجَعَ، هَرَعَ، هَرَقَ، هَلَكَ، دَرَكَ"

const iafiil = "بَحِرَ، بَخِلَ، بَرِحَ، بَرِصَ، بَرِمَ، بَشِعَ،  بَغِضَ، بَلِهَ، بَهِتَ، تَبِعَ، تَخِذَ، تَخِمَ، تَرِبَ، تَرِفَ، تَعِبَ، تَلِفَ، ثَقِفَ، ثَقِلَ، ثَمِلَ، جَذِلَ، جَذِمَ، جَرِبَ، جَفِلَ، جَهِدَ، جَهِرَ، جَهِلَ، حَبِلَ، حَذِرَ، حَرِدَ، حَرِصَ، حَزِنَ، حَسِبَ، حَسِرَ، حَفِظَ، حَلِبَ، حَلِمَ، حَمِدَ، حَمِرَ، حَمِسَ، حَنِثَ، خَبِرَ، خَجِلَ، خَرِبَ، خَرِسَ، خَرِفَ، خَرِقَ، خَرِمَ، خَسِرَ، خَضِبَ، خَضِرَ، خَفِرَ، خَلِفَ، خَلِقَ، دَسِمَ، دَعِرَ، دَمِلَ، دَنِسَ، دَهِشَ، رَبِحَ، رَحِمَ، رَسِلَ، رَضِعَ، رَعِفَ، رَغِبَ، رَغِدَ، رَكِبَ، رَمِدَ، رَهِبَ، رَهِلَ، زَرِبَ، زَعِلَ، زَلِعَ، زَلِقَ، زَمِرَ، زَهِدَ، زَهِرَ، سَحِرَ، سَحِقَ، سَخِرَ، سَخِطَ، سَدِلَ، سَرِعَ، سَعِدَ، سَعِفَ، سَفِدَ، سَفِهَ، سَكِرَ، سَلِبَ، سَلِسَ، سَلِطَ، سَلِمَ، سَمِرَ، سَمِعَ، سَمِنَ، سَهِرَ، شَبِعَ، شَبِقَ، شَجِعَ، شَحِنَ، شَرِبَ، شَرِقَ، شَرِهَ، شَعِبَ، شَعِثَ، شَعِرَ، شَقِرَ، شَكِرَ، شَكِلَ، شَمِتَ، شَمِسَ، شَمِلَ، شَنِعَ، شَهِدَ، صَبِحَ، صَحِبَ، صَخِبَ، صَدِفَ، صَعِدَ، صَغِرَ، صَفِرَ، صَلِعَ، صَهِبَ، ضَبِطَ، ضَجِرَ، ضَحِكَ، ضَرِبَ، ضَرِسَ، ضَرِعَ، ضَرِمَ، ضَغِنَ، ضَمِدَ، ضَمِنَ، طَبِعَ، طَرِبَ، طَرِحَ، طَرِشَ، طَرِقَ، طَعِمَ، طَفِقَ، طَفِلَ، طَلِعَ، طَلِقَ، طَمِعَ، ظَفِرَ، ظَلِفَ، عَثِرَ، عَجِبَ، عَجِزَ، عَجِلَ، عَدِلَ، عَدِمَ، عَرِبَ، عَرِجَ، عَرِفَ، عَرِقَ، عَسِرَ، عَشِبَ، عَشِقَ، عَطِرَ، عَطِشَ، عَطِلَ، عَكِرَ، عَلِقَ، عَلِمَ، عَمِرَ، عَمِلَ، عَهِدَ، غَبِطَ، غَرِدَ، غَرِقَ، غَزِلَ، غَضِبَ، غَفِرَ، غَلِبَ، غَلِطَ، غَنِجَ، غَنِمَ، فَرِجَ، فَرِحَ، فَرِخَ، فَرِغَ، فَرِقَ، فَزِعَ، فَشِلَ، فَضِلَ، فَطِنَ، فَظِعَ، فَقِهَ، فَكِهَ، فَهِمَ، قَبِلَ، قَدِرَ، قَرِفَ، قَفِرَ، قَفِزَ، قَلِقَ، قَنِعَ، كَبِدَ، كَبِرَ، كَحِلَ، كَدِرَ، كَرِبَ، كَرِجَ، كَرِشَ، كَرِهَ، كَسِلَ، كَشِفَ، كَفِلَ، كَلِبَ، كَلِفَ، كَمِنَ، لَبِثَ، لَبِسَ، لَبِقَ، لَبِنَ، لَحِقَ، لَحِمَ، لَحِنَ، لَزِقَ، لَزِمَ، لَسِنَ، لَصِقَ، لَعِبَ، لَقِحَ، مَرِحَ، مَرِسَ، مَرِضَ، مَرِعَ، مَرِغَ، مَعِضَ، مَعِطَ، مَعِنَ، مَغِصَ، مَكِرَ، مَلِسَ، مَهِلَ، نَجِزَ، نَجِسَ، نَحِسَ، نَحِلَ، نَدِمَ، نَزِقَ، نَزِلَ، نَشِطَ، نَشِفَ، نَشِقَ، نَصِبَ، نَضِجَ، نَضِرَ، نَعِمَ، نَغِصَ، نَفِدَ، نَقِهَ، نَمِرَ، نَهِجَ، هَرِبَ، هَرِمَ، هَزِجَ، هَزِلَ، هَلِعَ، هَلِكَ"

const uufiil = "بَصُرَ، بَعُدَ، بَغُضَ، بَكُمَ، بَلُدَ، ثَخُنَ، ثَقُفَ، ثَقُلَ، جَبُنَ، جَدُبَ، جَدُرَ، جَسُمَ، جَعُدَ، جَلُدَ، جَمُدَ، جَهُرَ، حَزُمَ، حَسُبَ، حَسُنَ، حَصُنَ، حَكُمَ، حَلُمَ، حَمُقَ، خَبُثَ، خَثُرَ، خَرُفَ، خَرُقَ، خَرُمَ، خَشُنَ، خَفُضَ، خَلُعَ، خَلُقَ، دَمُثَ، ذَبُلَ، ذَلُقَ، رَحُبَ، رَحُمَ، رَخُصَ، رَصُنَ، رَعُفَ، رَغُدَ، رَفُقَ، زَهُدَ، زَهُرَ، سَخُفَ، سَرُعَ، سَفُلَ، سَفُهَ، سَمُحَ، سَهُلَ، سَهُمَ، شَجُعَ، شَخُصَ، شَرُفَ، شَعُرَ، شَنُعَ، صَرُحَ، صَرُمَ، صَعُبَ، صَغُرَ، صَلُبَ، صَلُحَ، ضَخُمَ، ضَرُبَ، ضَعُفَ، ضَمُرَ، طَفُلَ، طَلُقَ، طَهُرَ، ظَرُفَ، عَجُزَ، عَدُلَ، عَذُبَ، عَرُبَ، عَرُضَ، عَرُفَ، عَسُرَ، عَشُبَ، عَظُمَ، عَمُرَ، عَمُقَ، عَنُدَ، عَنُفَ، غَرُبَ، غَزُرَ، غَلُظَ، غَمُضَ، فَحُشَ، فَخُمَ، فَرُسَ، فَرُغَ، فَسُدَ، فَصُحَ، فَضُلَ، فَطُنَ، فَظُعَ، فَقُرَ، قَبُحَ، قَدُمَ، قَذُرَ، قَرُبَ، قَصُرَ، قَعُرَ، كَبُرَ، كَثُرَ، كَثُفَ، كَدُرَ، كَرُمَ، كَمُلَ، لَحُمَ، لَطُفَ، مَتُنَ، مَثُلَ، مَجُدَ، مَحُضَ، مَحُلَ، مَرُعَ، مَعُنَ، مَقُتَ، مَكُنَ، مَلُحَ، مَلُسَ، مَنُعَ، مَهُنَ، نَبُلَ، نَبُهَ، نَجُبَ، نَجُدَ، نَجُسَ، نَحُسَ، نَحُفَ، نَحُلَ، نَدُرَ، نَزُرَ، نَزُهَ، نَضُرَ، نَظُفَ، نَعُمَ، نَقُصَ، نَهُدَ"

const iifiil = "حَسِبَ، نَعِمَ"

function jadiarray(str){
    return str.replace(/[َُِْ]/g, "").split("، ");
}

const auarray = jadiarray(aufiil);
const aiarray = jadiarray(aifiil);
const aaarray = jadiarray(aafiil);
const uuarray = jadiarray(uufiil);
const iiarray = jadiarray(iifiil);
const iaarray = jadiarray(iafiil);
const kumsohr = auarray.concat(aiarray).concat(aaarray).concat(uuarray).concat(iiarray).concat(iaarray);

const baid = "بَصُرَ، بَعُدَ، ثَخُنَ، ثَقُفَ، ثَقُلَ، حَزُمَ، حَسُبَ، حَكُمَ، حَلُمَ، حَمُقَ، خَبُثَ، خَثُرَ، خَرُفَ، خَرُقَ، خَرُمَ، خَشُنَ، خَفُضَ، خَلُعَ، ذَبُلَ، ذَلُقَ، رَحُبَ، رَحُمَ، رَخُصَ، رَصُنَ، رَعُفَ، رَفُقَ، سَخُفَ، سَرُعَ، سَفُلَ، سَفُهَ، سَمُحَ، شَرُفَ، شَنُعَ، صَرُحَ، صَرُمَ، صَغُرَ، ضَعُفَ، ضَمُرَ، طَلُقَ، عدُلَ، عَرُفَ، عَسُرَ، عَشُبَ، عَظُمَ، عَمُقَ، غَرُبَ، غَزُرَ، غَلُظَ، غَمُضَ، فَحُشَ، فَخُمَ، فَرُسَ، فَرُغَ، فَصُحَ، فَظُعَ، فَقُرَ، قَبُحَ، قَدُمَ، قَرُبَ، قَصُرَ، قَعُرَ، كَبُرَ، كَثُرَ، كَثُفَ، كَرُمَ، كَمُلَ، لَطُفَ، مَجُدَ، مَحُضَ، مَحُلَ، مَرُعَ، مَعُنَ، مَقُتَ، مَكُنَ، مَلُحَ، مَلُسَ، مَنُعَ، مَهُنَ، نَبُلَ، نَبُهَ، نَجُبَ، نَجُسَ، نَحُسَ، نَحُفَ، نَحُلَ، نَزُرَ، نَزُهَ، نَضُرَ، نَظُفَ، نَعُمَ، نَقُصَ"

const hasan = "بَلُدَ، جَدُرَ، جَمُدَ، حَسُنَ، رَغُدَ، عَرُبَ، فَسُدَ، فَطُنَ، قَذُرَ"

const jild = "جَدُرَ، جَسُمَ، جَلُدَ، حَصُنَ،  خَفُضَ، رَفُقَ, طَفُلَ، مَثُلَ، نَعُمَ"

const suja = "شَجُعَ"

const jaban = "جَبُنَ"

const sahl = "جَهُرَ، سَهُلَ، سَهُمَ، شَخُصَ، صَعُبَ، ضَخُمَ، ظَرُفَ، فَضُلَ، نَجُدَ، نَحُسَ"

const baidray = jadiarray(baid);
const hasanray = jadiarray(hasan);
const jildray = jadiarray(jild);
const sujaray = jadiarray(suja)
const jabanray = jadiarray(jaban);
const sahlray = jadiarray(sahl);


// shohih mudhoaf
const aumudoaf = "أَمَّ، بَتَّ، بَثَّ، بَدَّ، بَذَّ، بَرَّ، بَلَّ، جَدَّ، جَرَّ، جَزَّ، جَفَّ، جَلَّ، جَنَّ، حَتَّ، حَثَّ، حَجَّ، حَدَّ، حَزَّ، حَسَّ، حَشَّ، حَضَّ، حَطَّ، حَفَّ، حَقَّ، حَكَّ، حَلَّ، حَمَّ، حَنَّ، خَرَّ، خَسَّ، خَشَّ، خَصَّ، خَطَّ، دَرَّ، دَسَّ، دَقَّ، دَكَّ، دَلَّ، ذَمَّ، رَدَّ، رَشَّ، رَضَّ، رَكَّ، زَجَّ، زَفَّ، زَمَّ، سَبَّ، سَدَّ، سَرَّ، سَلَّ، سَنَّ، شَبَّ، شَجَّ، شَدَّ، شَذَّ، شَطَّ، شَعَّ، شَقَّ، شَكَّ، شَمَّ، شَنَّ، صَبَّ، صَدَّ، صَرَّ، صَفَّ، صَكَّ، صَمَّ، ضَجَّ، ضَرَّ، ضَمَّ، طَلَّ، ظَنَّ، عَثَّ، عَدَّ، عَزَّ، عَضَّ، عَكَّ، عَمَّ، عَنَّ، غَرَّ، غَزَّ، غَشَّ، غَضَّ، غَلَّ، غَمَّ، فَتَّ، فَزَّ، فَشَّ، فَضَّ، فَكَّ، قَدَّ، قَصَّ، قَطَّ، كَدَّ، كَزَّ، كَفَّ، كَمَّ، لَفَّ، لَمَّ، مَتَّ، مَجَّ، مَدَّ، مَرَّ، مَزَّ، مَسَّ، مَصَّ، مَضَّ، مَطَّ، مَلَّ، مَنَّ، نَطَّ، هَبَّ، هَدَّ، هَزَّ، هَشَّ، هَلَّ، هَمَّ";
const iamudoaf = "بَدَّ، بَرَّ، بَلَّ، جَفَّ، جَلَّ، حَبَّ، حَمَّ، خَسَّ، خَصَّ، دَلَّ، رَفَّ، زَجَّ، سَدَّ، سَرَّ، شَجَّ، شَمَّ، صَبَّ، صَكَّ، صَمَّ، ضَلَّ، طَلَّ، ظَلَّ، عَزَّ، عَضَّ، غَثَّ، غَضَّ، غَلَّ، غَمَّ، فَكَّ، لَجَّ، لَذَّ، مَرَّ، مَسَّ، مَصَّ، مَضَّ، مَلَّ، هَدَّ، هَشَّ";
const uumudoaf = "حَبَّ، عَزَّ، فَكَّ، هَمَّ";
const aamudoaf = "جَرَّ، حَقَّ، حَلَّ، عَضَّ، غَصَّ، مَزَّ، مَضَّ، هَبَّ";
const aimudoaf = "أَنَّ، بَتَّ، بَثَّ، بَرَّ، بَصَّ، بَلَّ، تَمَّ، جَدَّ، جَفَّ، جَلَّ، جَنَّ، حَبَّ، حَدَّ، حَسَّ، حَفَّ، حَقَّ، حَلَّ، حَنَّ، خَفَّ، دَبَّ، دَقَّ، دَلَّ، ذَلَّ، رَقَّ، رَكَّ، رَنَّ، زَفَّ، سَدَّ، سَلَّ، شَبَّ، شَجَّ، شَحَّ، شَدَّ، شَطَّ، شَنَّ، صَبَّ، صَحَّ، صَدَّ، صَرَّ، ضَجَّ، ضَلَّ، طَلَّ، طَنَّ، عَزَّ، عَفَّ، عَنَّ، غَثَّ، غَرَّ، غَضَّ، غَلَّ، فَرَّ، فَزَّ، قَلَّ، كَرَّ، كَلَّ، لَجَّ، نَدَّ، نَزَّ، هَبَّ، هَدَّ، هَزَّ، هَشَّ، هَمَّ";
const iimudoaf = "";

// jadikan array
const aumudoafr = jadiarray(aumudoaf);
const iamudoafr = jadiarray(iamudoaf);
const iimudoafr = jadiarray(iimudoaf);
const uumudoafr = jadiarray(uumudoaf);
const aamudoafr = jadiarray(aamudoaf);
const aimudoafr = jadiarray(aimudoaf);

// shohih mahmuz fa
const aumahmuzfa = "أَبَرَ، أَبَلَ، أَبَنَ، أَثَرَ، أَخَذَ، أَرَشَ، أَرَضَ، أَشَرَ، أَكَدَ، أَكَلَ، أَلَفَ، أَمَرَ، أَمَلَ، أَهَلَ";
const iamahmuzfa = "أَبِدَ، أَبِهَ، أَثِمَ، أَحِدَ، أَذِنَ، أَزِفَ، أَسِفَ، أَلِفَ، أَلِمَ، أَمِدَ، أَنِسَ، أَنِفَ، أَنِقَ، أَهِلَ";
const uumahmuzfa = "أَدُبَ، أَزُفَ، أَسُلَ، أَصُلَ، أَنُثَ، أَنُسَ";
const aamahmuzfa = "أَرَخَ، أَلَهَ";
const aimahmuzfa = "أَثَرَ، أَجَمَ، أَدَمَ، أَرَزَ، أَرَمَ، أَزَرَ، أَزَلَ، أَسَدَ، أَسَرَ، أَشَبَ، أَصَرَ، أَفَقَ، أَفَكَ، أَلَفَ، أَلَقَ، أَلَكَ، أَمَنَ، أَهَلَ";
const iimahmuzfa = "";
// jadikan array
const aumahmuzfar = jadiarray(aumahmuzfa);
const aimahmuzfar = jadiarray(aimahmuzfa);
const iamahmuzfar = jadiarray(iamahmuzfa);
const uumahmuzfar = jadiarray(uumahmuzfa);
const aamahmuzfar = jadiarray(aamahmuzfa);
const iimahmuzfar = jadiarray(iimahmuzfa);

// shohih mahmuz lam
const aumahmuzlam = "هَنَأَ";
const iamahmuzlam = "بَرِأَ، خَطِأَ، دَفِأَ، صَدِأَ، ظَمِأَ، فَتِأَ، مَرِأَ، هَرِأَ، هَزِأَ، هَنِأَ";
const uumahmuzlam = "بَطُأَ، جَرُأَ، دَنُأَ، رَدُأَ، صَدُأَ، قَمُأَ، مَرُأَ، هَنُأَ";
const aamahmuzlam = "بَدَأَ، جَفَأَ، خَطَأَ، رَفَأَ، صَدَأَ، عَبَأَ، فَجَأَ، فَقَأَ، قَرَأَ، لَجَأَ، مَلَأَ، نَشَأَ، هَجَأَ، هَدَأَ، هَنَأَ";
const aimahmuzlam = "";
const iimahmuzlam = "";
// jadikan array
const aumahmuzlamr = jadiarray(aumahmuzlam);
const iamahmuzlamr = jadiarray(iamahmuzlam);
const iimahmuzlamr = jadiarray(iimahmuzlam);
const uumahmuzlamr = jadiarray(uumahmuzlam);
const aimahmuzlamr = jadiarray(aimahmuzlam);
const aamahmuzlamr = jadiarray(aamahmuzlam);


// shohih mahmuz ain
const aumahmuzain = "";
const iamahmuzain = "بَأِسَ، ذَأِبَ، رَأِفَ، سَأِمَ، كَأِبَ";
const uumahmuzain = "بَأُسَ، رَأُسَ، رَأُفَ، شَأُمَ، ضَأُلَ، لَأُمَ";
const aamahmuzain = "ثَأَرَ، دَأَبَ، رَأَفَ، سَأَلَ، لَأَمَ";
const aimahmuzain = "رَأَسَ، زَأَرَ"
const iimahmuzain = "";
// jadikan array
const aumahmuzainr = jadiarray(aumahmuzain);
const iamahmuzainr = jadiarray(iamahmuzain);
const uumahmuzainr = jadiarray(uumahmuzain);
const aimahmuzainr = jadiarray(aimahmuzain);
const aamahmuzainr = jadiarray(aamahmuzain);
const iimahmuzainr = jadiarray(iimahmuzain);


// mu'tal fa / misal
const aumisal = "وَجَدَ، وَجَلَ، يَمَنَ";
const iamisal = "وَجِعَ، وَجِلَ، وَحِلَ، وَحِمَ، وَخِمَ، وَدَّ، وَرِبَ، وَرِكَ، وَسِخَ، وَسِعَ، وَضِحَ، وَضِعَ، وَطِئَ، وَلِعَ، وَلِهَ، وَهِمَ، يَئِسَ، يَبِسَ، يَسِرَ، يَقِظَ، يَقِنَ";
const uumisal = "وَثُقَ، وَجُزَ، وَجُهَ، وَخُمَ، وَدُعَ، وَرُدَ، وَرُعَ، وَزُنَ، وَسُطَ، وَسُعَ، وَسُمَ، وَشُكَ، وَضُؤَ، وَضُعَ، وَعُرَ، وَفُرَ، وَقُحَ، وَقُرَ، وَهُنَ، يَتُمَ، يَسُرَ، يَقُظَ، يَمُنَ";
const aamisal = "وَدَعَ، وَضَعَ، وَطَأَ، وَقَعَ، وَلَعَ، وَمَأَ، وَهَبَ، يَنَعَ";
const aimisal = "وَأَدَ، وَبَلَ، وَتَدَ، وَتَرَ، وَثَبَ، وَجَدَ، وَجَسَ، وَجَمَ، وَحَدَ، وَحَشَ، وَحَلَ، وَخَزَ، وَرَدَ، وَرَقَ، وَزَرَ، وَزَنَ، وَسَمَ، وَشَمَ، وَصَدَ، وَصَفَ، وَصَلَ، وَصَمَ، وَضَحَ، وَطَنَ، وَعَدَ، وَعَظَ، وَغَرَ، وَغَلَ، وَفَدَ، وَقَدَ، وَقَفَ، وَكَلَ، وَلَجَ، وَلَخَ، وَلَدَ، وَلَسَ، وَلَفَ، وَلَهَ، وَمَضَ، وَهَمَ، وَهَنَ، يَتَمَ، يَسَرَ";
const iimisal = "وَثِقَ، وَحِدَ، وَرِثَ، وَرِعَ، وَرِكَ، وَرِمَ، وَمِقَ، وَهِبَ، وَهِنَ، يَئِسَ، يَبِسَ";

// mu'tal ain / ajwaf
const auajwaf = "آبَ، آدَ، آلَ، آنَ، بَاءَ، بَاحَ، بَارَ، بَاسَ، بَالَ، تَابَ، تَاهَ، ثَابَ، ثَارَ، جَاءَ، جَادَ، جَارَ، جَازَ، جَاشَ، جَاعَ، جَالَ، حَازَ، حَاطَ، حَالَ، حَامَ، خَابَ، خَارَ، خَاضَ، خَالَ، خَانَ، دَاخَ، دَارَ، دَاسَ، دَالَ، دَامَ، دَانَ، ذَابَ، ذَادَ، ذَاقَ، رَاجَ، رَاحَ، رَاضَ، رَاعَ، رَاغَ، رَاقَ، رَامَ، زَارَ، زَاعَ، زَاغَ، زَالَ، سَاءَ، سَادَ، سَارَ، سَاسَ، سَاغَ، سَاقَ، سَامَ، شَابَ، شَاطَ، شَافَ، شَالَ، صَاتَ، صَاحَ، صَاغَ، صَامَ، صَانَ، ضَاعَ، طَارَ، طَافَ، طَالَ، عَادَ، عَازَ، عَافَ، عَالَ، عَامَ، غَاصَ، فَاتَ، فَاحَ، فَارَ، فَازَ، فَاقَ، فَاهَ، قَادَ، قَاسَ، قَالَ، قَامَ، كَانَ، لاَحَ، لاَذَ، لاَمَ، مَاتَ، مَاجَ، نَاءَ، نَابَ، نَاحَ، هَانَ";
const iaajwaf = "أَوِبَ، أَوِدَ، أَوِلَ، خَافَ، خَالَ، سَوِدَ، شَاءَ، عَوِجَ، عَوِرَ، غَارَ، كَادَ، كَوِعَ، نَالَ، نَامَ، هَابَ";
const uuajwaf = "هَيُؤَ";
const aaajwaf = "بَاتَ، حَارَ، دَاءَ، دَامَ، سَالَ، صَاتَ، عَامَ";
const aiajwaf = "آَضَ، بَاتَ، بَاضَ، بَاعَ، بَانَ، جَاأَ، حَانَ، خَابَ، خَاطَ، دَانَ، ذَاعَ، رَابَ، رَاثَ، زَاحَ، زَادَ، زَاغَ، سَاجَ، سَاحَ، سَارَ، سَالَ، شَابَ، شَاخَ، شَادَ، شَاعَ، شَالَ، شَانَ، صَاحَ، صَارَ، ضَاعَ، ضَاقَ، طَابَ، طَارَ، طَاشَ، عَابَ، عَالَ، عَامَ، عَانَ، غَابَ، غَاضَ، غَاظَ، فَاضَ، قَاءَ، قَاسَ، قَالَ، قَانَ، كَادَ، كَالَ، لاَنَ، مَاتَ، مَادَ، مَازَ، مَالَ، هَاجَ، هَالَ، هَامَ";
const iiajwaf = "";

// mu'tal lam / naqish
const aunaqis = "أَبَا، أَخَا، أَدَى، أَسَا، أَلَا، أَمَا، بَدَا، تَلَا، جَثَا، جَفَا، جَلَا،حَسَا، حَشَا، حَلَا، حَنَا،خَبَا، خَطَا، خَلَا، دَجَا، دَعَا، دَنَا، ذَرَا، رَبَا، رَجَا، رَشَا،رَغَا، رَفَا، رَنَا، زَكَا،زَهَا، سَجَا، سَرَا، سَلَا، سَمَا، سَهَا، شَأَى، شَتَا، شَجَا، شَقَا، شَكَا، صَبَا، صَفَا، طَغَا، طَفَا، طَهَا، عَدَا، عَرَا، عَزَا، عَشَا،عَصَا، عَفَا، عَلَا، غَدَا، غَزَا، غَلَا، فَشَا، قَسَا، قَفَا، كَبَا، كَسَا، لَحَا، لَهَا، مَحَا، نَبَا، نَجَا، نَحَا، نَمَا، هَجَا";
const ianaqis = "أَذِيَ، أَسِيَ، بَقِيَ، بَلِيَ، تَلِيَ، حَظِيَ، حَلِيَ، حَمِيَ، خَشِيَ، دَمِيَ، رَضِيَ، رَقِيَ، سَخِيَ، شَظِيَ، شَهِيَ، طَرِيَ، عَرِيَ، عَشِيَ، عَصِيَ، عَمِيَ، عَنِيَ، غَبِيَ، غَشِيَ، غَنِيَ، فَتِيَ، فَنِيَ، لَظِيَ، لَقِيَ، نَدِيَ، نَسِيَ";
const uunaqis = "سَهُوَ، سَرُوَ";
const aanaqis = "خَبَى، رَأَى، رَعَى، سَعَى، مَحَا، نَأَى، نَعَى، نَهَى";
const ainaqis = "أَتَى، أَرَى، أَسَى، أَمَى، أَنَى، بَرَى، بَغَى، بَقَى، بَكَى، بَنَى، ثَنَى، جَبَى، جَثَى، جَرَى، جَزَى، جَنَى، حَصَى، حَكَى، حَلَى، حَمَى، حَنَى، خَصَى، خَفَى، دَرَى، رَقَى، رَمَى، زَرَى، زَنَى، سَبَى، سَقَى، شَفَى، طَلَى، عَسَى، عَنَى، غَلَى، غَمَى، فَدَى، فَرَى، فَنَى، قَضَى، كَفَى، مَشَى، مَضَى، نَفَى، هَدَى، هَذَى"
const iinaqis = "";

// lafif maqrun 
const iamaqrun = "حَيِيَ، سَوِيَ، عَيِيَ، غَوِيَ، قَوِيَ";
const aimaqrun = "أَوَى، ثَوَى، حَوَى، رَوَى، شَوَى، طَوَى، عَوَى، غَوَى، كَوَى، لَوَى، نَوَى، هَوَى";

// lafif mafruq
const iamafruq = "وَنِيَ";
const aimafruq = "أَوَى، ثَوَى، حَوَى، رَوَى، شَوَى، طَوَى، عَوَى، غَوَى، كَوَى، لَوَى، نَوَى، هَوَى";
const iimafruq = "وَرِيَ، وَلِيَ";

const aumisalr = jadiarray(aumisal);
const iamisalr = jadiarray(iamisal);
const uumisalr = jadiarray(uumisal);
const iimisalr = jadiarray(iimisal);
const aamisalr = jadiarray(aamisal);
const aimisalr = jadiarray(aimisal);
const auajwafr = jadiarray(auajwaf);
const iaajwafr = jadiarray(iaajwaf);
const uuajwafr = jadiarray(uuajwaf);
const iiajwafr = jadiarray(iiajwaf);
const aaajwafr = jadiarray(aaajwaf);
const aiajwafr = jadiarray(aiajwaf);
const aunaqisr = jadiarray(aunaqis);
const ianaqisr = jadiarray(ianaqis);
const uunaqisr = jadiarray(uunaqis);
const iinaqisr = jadiarray(iinaqis);
const aanaqisr = jadiarray(aanaqis);
const ainaqisr = jadiarray(ainaqis);
const iamaqrunr = jadiarray(iamaqrun);
const aimaqrunr = jadiarray(aimaqrun);
const iamafruqr = jadiarray(iamafruq);
const aimafruqr = jadiarray(aimafruq);
const iimafruqr = jadiarray(iimafruq);

const kumajwafr = auajwafr.concat(aiajwafr).concat(aaajwafr).concat(iiajwafr).concat(uuajwafr).concat(iaajwafr);
const kummudoafr = aumudoafr.concat(aimudoafr).concat(aamudoafr).concat(iimudoafr).concat(uumudoafr).concat(iamudoafr);
const kummhzainr = aumahmuzainr.concat(aimahmuzainr).concat(aamahmuzainr).concat(iimahmuzainr).concat(iamahmuzainr).concat(uumahmuzainr)





// mazid shohih salim 
const tasydidain = "بَتَّلَ، بَخَّرَ، بَدَّلَ، بَذَّرَ، بَرَّدَ، بَرَّرَ، بَسَّطَ، بَشَّرَ، بَصَّرَ، بَطَّنَ، بَغَّضَ، بَقَّعَ، بَكَّرَ، بَكَّلَ، بَلَّدَ، بَلَّطَ، بَلَّعَ، بَلَّغَ، تَبَّلَ، تَرَّبَ، تَرَّحَ، تَمَّرَ، ثَبَّتَ، ثَقَّبَ، ثَقَّفَ، ثَقَّلَ، ثَلَّمَ، ثَمَّرَ، ثَمَّنَ، جَدَّلَ، جَذَّرَ، جَذَّفَ، جَرَّبَ، جَرَّدَ، جَرَّسَ، جَرَّعَ، جَسَّدَ، جَسَّمَ، جَفَّلَ، جَلَّسَ، جَمَّدَ، جَمَّرَ، جَمَّعَ، جَمَّلَ، جَنَّبَ، جَنَّحَ، جَنَّسَ، جَهَّزَ، حَبَّذَ، حَبَّرَ، حَبَّلَ، حَجَّرَ، حَجَّمَ، حَدَّثَ، حَدَّرَ، حَدَّقَ، حَذَّرَ، حَرَّصَ، حَرَّضَ، حَرَّفَ، حَرَّكَ، حَرَّمَ، حَزَّمَ، حَسَّرَ، حَسَّنَ، حَصَّلَ، حَصَّنَ، حَضَّرَ، حَطَّمَ، حَظَّرَ، حَقَّرَ، حَكَّمَ، حَلَّفَ، حَلَّقَ، حَلَّمَ، حَمَّرَ، حَمَّسَ، حَمَّصَ، حَمَّضَ، حَمَّلَ، حَنَّطَ، حَنَّكَ، خَبَّرَ، خَبَّلَ، خَدَّرَ، خَرَّبَ، خَرَّسَ، خَرَّقَ، خَرَّمَ، خَسَّرَ، خَشَّبَ، خَشَّنَ، خَضَّبَ، خَضَّرَ، خَضَّعَ، خَفَّضَ، خَلَّصَ، خَلَّطَ، خَلَّعَ، خَلَّفَ، خَمَّرَ، خَمَّنَ، خَنَّثَ، دَبَّرَ، دَثَّرَ، دَجَّلَ، دَخَّلَ، دَخَّنَ، دَرَّبَ، دَرَّجَ، دَرَّسَ، دَسَّمَ، دَمَّرَ، ذَكَّرَ، ذَهَّبَ، رَبَّحَ، رَتَّبَ، رَتَّلَ، رَجَّحَ، رَجَّعَ، رَجَّلَ، رَحَّبَ، رَحَّلَ، رَخَّصَ، رَشَّحَ، رَصَّعَ، رَطَّبَ، رَغَّبَ، رَفَّعَ، رَفَّهَ، رَقَّصَ، رَقَّطَ، رَقَّمَ، رَكَّزَ، رَمَّدَ، رَمَّلَ، رَنَّمَ، زَبَّدَ، زَحَّلَ، زَرَّعَ، زَرَّفَ، زَغَّبَ، زَقَّمَ، زَلَّقَ، زَمَّرَ، زَنَّدَ، زَهَّدَ، زَهَّرَ، سَبَّعَ، سَجَّلَ، سَحَّقَ، سَخَّرَ، سَرَّبَ، سَرَّجَ، سَرَّحَ، سَطَّحَ، سَطَّرَ، سَعَّرَ، سَعَّفَ، سَفَّدَ، سَفَّرَ، سَفَّهَ، سَقَّفَ، سَكَّتَ، سَكَّرَ، سَكَّنَ، سَلَّبَ، سَلَّخَ، سَلَّفَ، سَلَّمَ، سَمَّدَ، سَمَّرَ، سَمَّعَ، سَمَّكَ، سَمَّنَ، سَنَّدَ، سَهَّلَ، شَبَّعَ، شَبَّكَ، شَبَّهَ، شَجَّرَ، شَجَّعَ، شَحَّذَ، شَخَّصَ، شَرَّبَ، شَرَّحَ، شَرَّدَ، شَرَّطَ، شَرَّعَ، شَرَّفَ، شَرَّقَ، شَرَّكَ، شَرَّمَ، شَطَّبَ، شَعَّبَ، شَعَّثَ، شَعَّرَ، شَعَّلَ، شَغَّلَ، شَفَّعَ، شَكَّلَ، شَمَّرَ، شَمَّسَ، شَنَّجَ، شَنَّعَ، شَنَّقَ، شَهَّدَ، شَهَّرَ، صَبَّحَ، صَبَّغَ، صَحَّفَ، صَدَّرَ، صَدَّقَ، صَرَّحَ، صَرَّفَ، صَرَّمَ، صَعَّبَ، صَعَّدَ، صَغَّرَ، صَفَّرَ، صَفَّقَ، صَلَّبَ، صَلَّعَ، صَمَّغَ، صَنَّعَ، صَنَّفَ، ضَبَّعَ، ضَجَّعَ، ضَرَّجَ، ضَرَّمَ، ضَعَّفَ، ضَمَّدَ، ضَمَّرَ، ضَمَّنَ، طَبَّخَ، طَبَّقَ، طَرَّبَ، طَرَّقَ، طَعَّمَ، طَلَّعَ، طَلَّقَ، طَمَّعَ، طَهَّرَ، ظَهَّرَ، عَبَّدَ، عَبَّرَ، عَجَّزَ، عَجَّلَ، عَدَّلَ، عَذَّبَ، عَرَّبَ، عَرَّجَ، عَرَّشَ، عَرَّضَ، عَرَّفَ، عَرَّقَ، عَرَّمَ، عَسَّرَ، عَشَّبَ، عَشَّرَ، عَصَّبَ، عَطَّرَ، عَطَّشَ، عَطَّلَ، عَظَّمَ، عَفَّرَ، عَفَّنَ، عَقَّبَ، عَقَّدَ، عَقَّلَ، عَقَمَّ، عَكَّرَ، عَلَّفَ، عَلَّقَ، عَلَّمَ، عَمَّدَ، عَمَّرَ، عَمَّقَ، عَمَّلَ، عَنَّسَ، عَنَّفَ، عَنَّقَ، غَبَّرَ، غَرَّبَ، غَرَّدَ، غَرَّقَ، غَرَّمَ، غَزَّرَ، غَسَّلَ، غَطَّسَ، غَلَّبَ، غَلَّطَ، غَلَّظَ، غَلَّفَ، غَمَّسَ، غَمَّضَ، غَنَّجَ، فَتَّحَ، فَتَّشَ، فَتَّقَ، فَجَّرَ، فَرَّجَ، فَرَّخَ، فَرَّدَ، فَرَّشَ، فَرَّصَ، فَرَّعَ، فَرَّغَ، فَرَّقَ، فَسَّحَ، فَسَّخَ، فَسَّرَ، فَسَّلَ، فَشَّلَ، فَصَّلَ، فَضَّلَ، فَطَّرَ، فَطَّمَ، فَطَّنَ، فَظَّعَ، فَعَّلَ، فَقَّرَ، فَقَّسَ، فَقَّهَ، فَكَّرَ، فَكَّهَ، فَهَّمَ، قَبَّلَ، قَتَّرَ، قَتَّلَ، قَحَّمَ، قَدَّرَ، قَدَّمَ، قَرَّبَ، قَرَّحَ، قَرَّفَ، قَسَّمَ، قَشَّرَ، قَصَّرَ، قَطَّبَ، قَطَّرَ، قَطَّعَ، قَطَّفَ، قَعَّرَ، قَفَّصَ، قَفَّلَ، قَلَّبَ، قَلَّدَ، قَلَّصَ، قَلَّعَ، قَلَّفَ، قَمَّعَ، قَنَّعَ، كَبَّدَ، كَبَّرَ، كَبَّسَ، كَبَّلَ، كَتَّبَ، كَتَّفَ، كَتَّلَ، كَتَّمَ، كَتَّنَ، كَثَّرَ، كَثَّفَ، كَحَّلَ، كَدَّرَ، كَدَّسَ، كَذَّبَ، كَرَّبَ، كَرَّجَ، كَرَّسَ، كَرَّمَ، كَرَّهَ، كَسَّبَ، كَسَّرَ، كَسَّفَ، كَشَّحَ، كَشَّرَ، كَشَّفَ، كَعَّبَ، كَفَّرَ، كَلَّفَ، كَلَّمَ، كَمَّلَ، كَهَّنَ، لَبَّسَ، لَبَّطَ، لَبَّكَ، لَبَّنَ، لَجَّمَ، لَحَّسَ، لَحَّفَ، لَحَّنَ، لَزَّقَ، لَطَّخَ، لَطَّفَ، لَعَّبَ، لَغَّمَ، لَفَّتَ، لَفَّقَ، لَقَّبَ، لَقَّحَ، لَقَّمَ، لَقَّنَ، لَمَّعَ، لَهَّبَ، مَتَّعَ، مَتَّنَ، مَثَّلَ، مَجَّدَ، مَحَّصَ، مَحَّلَ، مَخَّطَ، مَدَّنَ، مَرَّضَ، مَرَّغَ، مَرَّنَ، مَزَّقَ، مَسَّحَ، مَسَّكَ، مَصَّرَ، مَغَّطَ، مَقَّتَ، مَكَّرَ، مَكَّنَ، مَلَّحَ، مَلَّسَ، مَلَّكَ، مَهَّدَ، نَبَّتَ، نَبَّذَ، نَبَّلَ، نَبَّهَ، نَجَّحَ، نَجَّدَ، نَجَّزَ، نَجَّسَ، نَحَّسَ، نَحَّلَ، نَخَّلَ، نَزَّلَ، نَزَّهَ، نَسَّقَ، نَسَّمَ، نَشَّرَ، نَشَّطَ، نَشَّفَ، نَصَّبَ، نَضَّجَ، نَضَّدَ، نَطَّقَ، نَظَّفَ، نَظَّمَ، نَعَّلَ، نَعَّمَ، نَغَّصَ، نَغَّمَ، نَفَّخَ، نَفَّدَ، نَفَّذَ، نَفَّرَ، نَفَّسَ، نَفَّشَ، نَقَّبَ، نَقَّرَ، نَقَّصَ، نَقَّلَ، نَكَّدَ، نَكَّسَ، نَمَّرَ، نَهَّدَ، هَبَّطَ، هَجَّدَ، هَجَّرَ، هَجَّنَ، هَدَّمَ، هَذَّبَ، هَرَّبَ، هَرَّجَ، هَزَّجَ، هَشَّمَ";
